app/Http/Controllers/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('seiya', 'kseiya.915@docomo.ne.jp', '$2y$12$O1Qbh/kyMRB98Wg6or2sYe7tC8S9yQsSTv5OOmkAQtApIwh.gBce.', '2024-07-04 00:15:03', '2024-07-04 00:15:03')
---
    public function register(Request $request) {
        $user=User::create([
            'name'=>$request->name,
            'email'=>$request->email,
            'password'=>Hash::make($request->password),
        ]);

select * from `users` where `email` = 's.kameoka.227@ms.saitama-u.ac.jp' limit 1
---
    public function login(Request $request){

        if (Auth::attempt(['email'=>$request->email,'password'=>$request->password])){
            $user=User::whereEmail($request->email)->first();